<?php
    // ব্যবহারকারীর কাছ থেকে একটি সংখ্যা ইনপুট নিবে
    $year = intval(trim(fgets(STDIN)));
	
	// এখানে fgets(STDIN)ব্যবহারকারীর কাছ থেকে কীবোর্ডের মাধ্যমে ইনপুট নেওয়ার জন্য php তে ব্যবহৃত ফাংশন। STDIN হলো Standard Input, যা ব্যবহারকারীর ইনপুট সংগ্রহ করতে ব্যবহৃত হয়।
	// এখানে trim()ইনপুটের শুরু বা শেষে থাকা অতিরিক্ত ফাঁকা স্থান বা নতুন লাইন (\n) সরিয়ে দেয়। এটি ইনপুট পরিষ্কার করে।
	// এখানে intval()ইনপুটটিকে একটি পূর্ণসংখ্যা (integer) হিসাবে রূপান্তরিত করে। কারণ আমরা একটি বছর পরীক্ষা করব, যা সংখ্যায় হতে হবে।।

    // লিপ ইয়ার চেক করার লজিক
	
	// বছরটি লিপ ইয়ার কিনা তা চেক করা হচ্ছে তিনটি শর্তের মাধ্যমে  ৪ দিয়ে বিভাজ্য। ১০০ দিয়ে বিভাজ্য না হলে অথবা ৪০০ দিয়ে বিভাজ্য হলে।।
    if (($year % 4 == 0 && $year % 100 != 0) || ($year % 400 == 0)) {
        echo "$year is a leap year.\n";
    } else {
        echo "$year is not a leap year.\n";
    }
?>
